# Напишите функцию Python
# для суммирования всех чисел в списке.


def sum_list(x):
    return sum(x)


print(sum_list([45, 2, 3, 0, 7]))


def sum_sum(x):
    summa = 0
    for y in x:
        summa += y
    return summa


print(sum_sum([45, 2, 3, 0, 7]))
